In [1]:
import pandas as pd
import numpy as np

In [19]:
table = pd.read_csv('_devs_cons_raw.csv')

/Users/kyleslugg/opt/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3072: DtypeWarning: Columns (0,1,4) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [20]:
table.head()

,DEV_NAME,MANAGED_BY,TDS,CONS_TDS,CONS_NAME
0,1010 EAST 178TH STREET,1010 EAST 178TH STREET,180.0,180.0,1010 EAST 178TH STREET
1,104-14 TAPSCOTT STREET,REID APARTMENTS,242.0,167.0,REID APARTMENTS CONSOLIDATED
2,1162-1176 WASHINGTON AVENUE,CLAREMONT CONSOLIDATED,233.0,308.0,CLAREMONT CONSOLIDATED
3,131 SAINT NICHOLAS AVENUE,TAFT,154.0,97.0,TAFT CONSOLIDATED
4,1471 WATSON AVENUE,SOTOMAYOR HOUSES,214.0,67.0,SOTOMAYOR HOUSES CONSOLIDATED

In [21]:
unique_rows = table.drop_duplicates().dropna()

In [22]:
unique_rows.shape

(311, 5)

In [23]:
unique_rows.head()

,DEV_NAME,MANAGED_BY,TDS,CONS_TDS,CONS_NAME
0,1010 EAST 178TH STREET,1010 EAST 178TH STREET,180.0,180.0,1010 EAST 178TH STREET
1,104-14 TAPSCOTT STREET,REID APARTMENTS,242.0,167.0,REID APARTMENTS CONSOLIDATED
2,1162-1176 WASHINGTON AVENUE,CLAREMONT CONSOLIDATED,233.0,308.0,CLAREMONT CONSOLIDATED
3,131 SAINT NICHOLAS AVENUE,TAFT,154.0,97.0,TAFT CONSOLIDATED
4,1471 WATSON AVENUE,SOTOMAYOR HOUSES,214.0,67.0,SOTOMAYOR HOUSES CONSOLIDATED

In [24]:
unique_rows['TDS'] = unique_rows['TDS'].apply(lambda z: str(int(z)).zfill(3))
unique_rows['CONS_TDS'] = unique_rows['CONS_TDS'].apply(lambda z: str(int(z)).zfill(3))

In [25]:
unique_rows.head()

,DEV_NAME,MANAGED_BY,TDS,CONS_TDS,CONS_NAME
0,1010 EAST 178TH STREET,1010 EAST 178TH STREET,180,180,1010 EAST 178TH STREET
1,104-14 TAPSCOTT STREET,REID APARTMENTS,242,167,REID APARTMENTS CONSOLIDATED
2,1162-1176 WASHINGTON AVENUE,CLAREMONT CONSOLIDATED,233,308,CLAREMONT CONSOLIDATED
3,131 SAINT NICHOLAS AVENUE,TAFT,154,097,TAFT CONSOLIDATED
4,1471 WATSON AVENUE,SOTOMAYOR HOUSES,214,067,SOTOMAYOR HOUSES CONSOLIDATED

In [26]:
unique_rows.to_csv('DEVS_TO_CONSOLIDATION.csv')

In [29]:
cons = unique_rows[['CONS_NAME','CONS_TDS']].drop_duplicates()

In [30]:
cons.head()

                       CONS_NAME CONS_TDS
0         1010 EAST 178TH STREET      180
1   REID APARTMENTS CONSOLIDATED      167
2         CLAREMONT CONSOLIDATED      308
3              TAFT CONSOLIDATED      097
4  SOTOMAYOR HOUSES CONSOLIDATED      067

In [32]:
cons.shape

(141, 2)

In [33]:
cons.to_csv('CONS_NAME_TDS.csv')